Repository: NaufalRozan/myStessD
Catalog: lib/l10n/app_*.arb
Languages: id

source: Check Stress
id: Cek Stres

# chooseMethod
source: Choose a method
id: Pilih metode

# uploadPhoto
source: Upload a Photo
id: Unggah Foto

# takePhoto
source: Take a Photo
id: Ambil Foto

# predictionResult
source: Prediction of your face: {result}
id: Prediksi wajah Anda: {result}

# accuracyResult
source: With accuracy: {accuracy}%
id: Dengan akurasi: {accuracy}%

source: Suggestion:
id: Saran:

source: Face not detected
id: Wajah tidak terdeteksi

# aboutApp
source: About the Application
id: Tentang Aplikasi

source: Reference Suggestions
id: Referensi Saran

# aiRoboticsGroup
source: Artificial Intelligence and Robotics Research Group
id: Kelompok Riset Kecerdasan Buatan dan Robotika

# stressed
source: Stress
id: Stres

source: Not Stressed
id: Tidak Stres

source: Breathing Well
id: Bernapas dengan Baik

# breathingWellDetails
source: Take a moment to breathe deeply; focus on your breath for a few minutes to help calm the mind.
id: Luangkan waktu sejenak untuk bernapas dalam-dalam; fokuslah pada napas Anda selama beberapa menit untuk membantu menenangkan pikiran.

source: Short Meditation
id: Meditasi Singkat

# shortMeditationDetails
source: Take some time to try a short meditation or mindfulness practice; it can reduce stress and enhance mental clarity.
id: Luangkan waktu untuk mencoba meditasi singkat atau praktik mindfulness; ini dapat mengurangi stres dan meningkatkan kejernihan mental.

# physicalActivity
source: Engage in physical activity
id: Lakukan aktivitas fisik

# physicalActivityDetails
source: Physical activity is key to reducing stress; a short walk or a yoga session can help relax the body and mind.
id: Aktivitas fisik adalah kunci untuk mengurangi stres; jalan kaki singkat atau sesi yoga dapat membantu merilekskan tubuh dan pikiran.

# socializing
source: Socializing with Others
id: Bersosialisasi dengan Orang Lain

# socializingDetails
source: Talking to friends or family can provide the emotional support you need to feel better.
id: Berbicara dengan teman atau keluarga dapat memberikan dukungan emosional yang Anda butuhkan untuk merasa lebih baik.

# maintainRest
source: Continue to maintain your resting time
id: Terus pertahankan waktu istirahat Anda

# maintainRestDetails
source: Maintaining a balance between work and rest is important to prevent stress; remember to take time for yourself.
id: Menjaga keseimbangan antara pekerjaan dan istirahat penting untuk mencegah stres; ingatlah untuk meluangkan waktu untuk diri sendiri.

# doingHobby
source: Doing a Hobby
id: Melakukan Hobi

# doingHobbyDetails
source: Engaging in hobbies or activities that you enjoy can serve as a means of distraction from the daily pressures.
id: Terlibat dalam hobi atau aktivitas yang Anda nikmati dapat berfungsi sebagai sarana pengalihan dari tekanan sehari-hari.

source: Relaxation
id: Relaksasi

# relaxationDetails
source: Even if you may not feel stressed at the moment, regular relaxation practices such as yoga can help maintain peace of mind.
id: Meskipun Anda mungkin tidak merasa stres saat ini, praktik relaksasi rutin seperti yoga dapat membantu menjaga ketenangan pikiran.

# learningStressManagement
source: Learning to Manage Stress
id: Belajar Mengelola Stres

# learningStressManagementDetails
source: Education about stress and how to manage it can help you stay calm in challenging situations in the future.
id: Pendidikan tentang stres dan cara mengelolanya dapat membantu Anda tetap tenang dalam situasi menantang di masa depan.

# appName
source: Application Name
id: Nama Aplikasi

# appNameValue
source: MyStessD - Stress Detection Application
id: MyStessD - Aplikasi Deteksi Stres

# appVersion
source: Application Version
id: Versi Aplikasi

source: Developed By
id: Dikembangkan Oleh

# developedByValue
source: Slamet Riyadi, Cahya Damarjati, and Naufal Rozan
id: Slamet Riyadi, Cahya Damarjati, dan Naufal Rozan

source: Institution
id: Institusi

# institutionValue
source: Information Technology Study Program in collaboration with Artificial Intelligence and Robotics Research Group Universitas Muhammadiyah Yogyakarta
id: Program Studi Teknologi Informasi bekerja sama dengan Kelompok Riset Kecerdasan Buatan dan Robotika Universitas Muhammadiyah Yogyakarta

# aboutApplication
source: About the Application
id: Tentang Aplikasi

# aboutApplicationValue
source: This application utilizes a modified Convolutional Neural Network (CNN) to detect stress through facial expressions, with the hope of increasing individual awareness of their stress levels.
id: Aplikasi ini memanfaatkan Convolutional Neural Network (CNN) yang telah dimodifikasi untuk mendeteksi stres melalui ekspresi wajah, dengan harapan dapat meningkatkan kesadaran individu terhadap tingkat stres mereka sendiri.

source: Contact
id: Kontak

# referenceSource
source: Suggestion References
id: Referensi Saran

# referenceSourceValue
source: The suggestions provided are taken from trusted journals.
id: Saran-saran yang diberikan diambil dari jurnal-jurnal terpercaya.
